#+SETUPFILE: /home/cayek/.src/org-html-themes/setup/theme-readtheorg.setup

#+TITLE: Schotastic Programming
#+AUTHOR: Kevin Caye

#+PROPERTY: header-args :eval no-export :results output :exports results :session *R-coldstart-bench*

#+NAME: code_R_init
#+BEGIN_SRC R :results none :exports none 
library(tidyverse)
library(lubridate)
library(glue)
library(plotly)
library(here)

project_dir <- here()
data_dir <- here("data")
res_dir <- here("all_results")
#+END_SRC
** Results
#+CAPTION: This code chunk depends on [[R_init]]
#+NAME: R_show_results
#+BEGIN_SRC R :results value :colnames yes
## get restuls
res_df <- list.files(glue("{res_dir}/"), pattern = "*.csv", full.names = TRUE) %>%
  map(~read_csv(.x) %>%
        mutate(competitor = basename(.x) %>% str_replace("_results.csv",""))) %>%
  bind_rows()

res_df %>%
  filter(competitor != "null") %>%
  group_by(competitor) %>%
  summarise(score = - mean(score)) %>%
  arrange(-score)
#+END_SRC

#+RESULTS: R_show_results
| competitor |             score |
|------------+-------------------|
|        our | 0.195746543825866 |
|          1 | 0.194264788759281 |
|          2 | 0.192222435952008 |
|          3 |  0.19126490319826 |
